<template>
  <main>
    <Header />
    <div class="content">
      <h1 class="faq-title">FAQ</h1>

      <div class="container-col">
        <div class="faq-page-container">
          <div v-for="(item, index) in faqItems" :key="index" class="faq-item"
            :class="{ 'active': openedFaqIndex === index }">
            <div class="faq-question" @click="toggleFaq(index)">
              <h3 class="faq-question-text">{{ item.question }}</h3>
              <div class="faq-icon">
                <span v-if="openedFaqIndex === index"><img src="@/assets/icons/rev_strelka.svg"></span>
                <span v-else><img src="@/assets/icons/strelka.svg"></span>
              </div>
            </div>
            <div class="faq-answer" :class="{ 'open': openedFaqIndex === index }">
              <div class="faq-answer-content">
                <p class="inter-400">{{ item.answer }}</p>
              </div>
            </div>
          </div>
        </div>

        <div class="ask-question">
          <h4 class="sub-title">Остались вопросы?</h4>
          <div class="container-row">
            <a href="https://t.me/teacherplanner" class="tg-button">
              <img src="../../assets/images/telegram.svg"> Написать в поддержку</a>
          </div>
        </div>
      </div>
    </div>

    <Footer />
  </main>
</template>

<script lang="ts" setup>
import '../../assets/scss/faq.scss';
import Header from '../landing/blocks/Header.vue';
import Footer from '../landing/blocks/Footer.vue';

import { ref } from 'vue';

const openedFaqIndex = ref(null);
const faqItems = [
  {
    question: 'Нужно ли ученикам платить за доступ к платформе?',
    answer: 'Нет, для учеников пользование нашим сервисом абсолютно бесплатно'
  },
  {
    question: 'Не создаются задания, почему так?',
    answer: 'Нет, для учеников пользование нашим сервисом абсолютно бесплатно'
  },
  {
    question: 'Какой часовой пояс выбрать при создании карточки ученика?',
    answer: 'Ограничений по количеству учеников нет'
  },
  {
    question: 'Как быть, если ошибся при указании заработка по занятию?',
    answer: 'На текущий момент, наш сервис является бесплатным для всех пользователей. Успейте присоединиться и получить статус первого пользователя сервиса, в дальнейшем это гарантирует наличие специальных условий для Вас на пользование сервисом'
  },
  {
    question: 'Обязательно ли при создании карточки занятия указывать перерыв и напоминание?',
    answer: 'Если вы не будете использовать сервис, ваша учетная запись останется активной, и вы сможете вернуться в любое время без потери данных. Однако, если ваша учетная запись неактивна в течение длительного времени, мы можем связаться с вами для уточнения, желаете ли вы продолжить использование платформы'
  },
  {
    question: 'Как работает система абонементов?',
    answer: 'Если вы не будете использовать сервис, ваша учетная запись останется активной, и вы сможете вернуться в любое время без потери данных. Однако, если ваша учетная запись неактивна в течение длительного времени, мы можем связаться с вами для уточнения, желаете ли вы продолжить использование платформы'
  },
  {
    question: 'При регистрации нет предмета, который я преподаю. Какой указывать?',
    answer: 'Если вы не будете использовать сервис, ваша учетная запись останется активной, и вы сможете вернуться в любое время без потери данных. Однако, если ваша учетная запись неактивна в течение длительного времени, мы можем связаться с вами для уточнения, желаете ли вы продолжить использование платформы'
  },
  {
    question: 'Сколько хранится домашнее задание, заданное ученику?',
    answer: 'Если вы не будете использовать сервис, ваша учетная запись останется активной, и вы сможете вернуться в любое время без потери данных. Однако, если ваша учетная запись неактивна в течение длительного времени, мы можем связаться с вами для уточнения, желаете ли вы продолжить использование платформы'
  },
  {
    question: 'Что делать если ошибся при создании занятий?',
    answer: 'Если вы не будете использовать сервис, ваша учетная запись останется активной, и вы сможете вернуться в любое время без потери данных. Однако, если ваша учетная запись неактивна в течение длительного времени, мы можем связаться с вами для уточнения, желаете ли вы продолжить использование платформы'
  },
  {
    question: 'Как подключить уведомления от системы?',
    answer: 'Если вы не будете использовать сервис, ваша учетная запись останется активной, и вы сможете вернуться в любое время без потери данных. Однако, если ваша учетная запись неактивна в течение длительного времени, мы можем связаться с вами для уточнения, желаете ли вы продолжить использование платформы'
  },
  {
    question: 'После проведения занятия, баланс ученика не изменился',
    answer: 'Если вы не будете использовать сервис, ваша учетная запись останется активной, и вы сможете вернуться в любое время без потери данных. Однако, если ваша учетная запись неактивна в течение длительного времени, мы можем связаться с вами для уточнения, желаете ли вы продолжить использование платформы'
  },

];

const toggleFaq = (index) => {
  if (openedFaqIndex.value === index) {
    openedFaqIndex.value = null;
  } else {
    openedFaqIndex.value = index;
  }
};
</script>
